[
    {
        "model": "HW23.gamesdev",
        "pk": 1,
        "fields": {
            "nameDev": "Santa Monica",
            "description": ""
        }
    },
    {
        "model": "HW23.gamesdev",
        "pk": 2,
        "fields": {
            "nameDev": "Naughty Dog",
            "description": ""
        }
    },
    {
        "model": "HW23.gamesdev",
        "pk": 3,
        "fields": {
            "nameDev": "NetherRealm Studios",
            "description": ""
        }
    },
    {
        "model": "HW23.gamesdev",
        "pk": 4,
        "fields": {
            "nameDev": "CD Projekt RED",
            "description": ""
        }
    },
    {
        "model": "HW23.gamesdev",
        "pk": 5,
        "fields": {
            "nameDev": "Bethesda Softworks",
            "description": ""
        }
    },
    {
        "model": "HW23.categories",
        "pk": 1,
        "fields": {
            "title": "action",
            "slug": "action",
            "description": "жанр компьютерных игр, в котором делается упор на эксплуатацию физических возможностей игрока, в том числе координации глаз и рук и скорости реакции.",
            "is_active": true
        }
    },
    {
        "model": "HW23.categories",
        "pk": 2,
        "fields": {
            "title": "RPG",
            "slug": "RPG",
            "description": "знаменитый жанр компьютерных и видео игр, где основой игрового процесса является отогревание определенной роли. Игрок берёт под контроль определённого героя или героиню, с набором стандартных навыков, характеристик и умений.",
            "is_active": true
        }
    },
    {
        "model": "HW23.games",
        "pk": 1,
        "fields": {
            "name": "God of War",
            "pub_date": "2023-02-05",
            "upd_date": "2023-02-05",
            "release_date": "2018-04-20",
            "price": "40.00",
            "gameDev": 1,
            "slug": "god_of_war",
            "category": 1,
            "description": "God of War – новый взгляд на популярную серию, где бессмертный полубог принимает решение измениться. Для Кратоса это значит нарушить цикл насилия, недоверия и предательства, которое было с незапамятных времен в его семействе. Именно этот цикл привел его к самым ужасным решениям – сделке с Аресом, убийству семьи, сумасшествию и мести, что в итоге стало причиной уничтожения Олимпа. Решение Кратоса также значит полный контроль над яростью – теперь он должен сам решать, когда выпустить монстра, живущего внутри себя, а когда придержать его.\r\n\r\nВ новой God of War у Кратоса есть сын, рождение которого полностью изменило жизнь полубога...",
            "game_image": "HW23/images/God_of_War-_Ragnarök.jpg",
            "is_active_game": true
        }
    },
    {
        "model": "HW23.games",
        "pk": 2,
        "fields": {
            "name": "The Last of Us",
            "pub_date": "2023-02-05",
            "upd_date": "2023-02-05",
            "release_date": "2013-06-14",
            "price": "20.00",
            "gameDev": 2,
            "slug": "the_last_of_us",
            "category": 1,
            "description": "События в The Last of Us разворачиваются в Америке спустя несколько лет после глобальной катастрофы. Мир охватила страшная эпидемия, в результате которой большинство людей превратилось в безумных мутантов и лишь немногие, в том числе и главные герои игры, Джоэл и Элли, продолжили борьбу за выживание.",
            "game_image": "HW23/images/The_Last_of_Us_Cover.jpg",
            "is_active_game": true
        }
    },
    {
        "model": "HW23.games",
        "pk": 3,
        "fields": {
            "name": "Mortal Kombat",
            "pub_date": "2023-02-05",
            "upd_date": "2023-02-05",
            "release_date": "2011-04-19",
            "price": "15.00",
            "gameDev": 3,
            "slug": "mortal_kombat",
            "category": 1,
            "description": "Новый Mortal Kombat продолжает серию культовых файтингов. В нем вас ждут новые возможности нового движка, увлекательная сюжетная кампания, масштабный мультиплеер, а также встреча с уже полюбившимися вам бойцами. Стоит отметить, что, несмотря на новый трехмерный движок, все бои будут происходить в 2D. Помимо этого, кроме привычных поединков один на один, в Mortal Kombat присутствуют аркадные кооперативные бои и Tag-Team бои, поддерживающие до четырех человек онлайн. Не обойдется в игре и без фирменных ударов (Fatality), которыми можно добить уже побежденного противника и которые стали еще кровавее и ожесточеннее.",
            "game_image": "HW23/images/300x450.webp",
            "is_active_game": true
        }
    },
    {
        "model": "HW23.games",
        "pk": 4,
        "fields": {
            "name": "Cyberpunk 2077",
            "pub_date": "2023-02-05",
            "upd_date": "2023-02-05",
            "release_date": "2020-12-10",
            "price": "30.00",
            "gameDev": 4,
            "slug": "cyberpunk_2077",
            "category": 2,
            "description": "Cyberpunk 2077 – ролевой проект с нелинейным сюжетом, созданный на основе настольной игры Cyberpunk 2020, события которого разворачиваются в мрачном футуристическом мире с деградировавшим сообществом.\r\n\r\nГероем игры выступает молодой киберпанк V, который отправляется выполнять свой первый контракт в Найт-Сити, самый опасный мегаполис Америки, подконтрольный могущественным корпорациям. На темных улицах и огромных небоскребах города его будут поджидать сложные испытания, а также ситуации, требующие принимать сложные решения, последствия которых отразятся на всей игре.\r\n\r\nПомимо продолжительной сюжетной линии, в Cyberpunk 2077 присутствуют увлекательные сайд-квесты и множество других активностей, которыми наполнен необъятный Найт-Сити. Благодаря редактору персонажа вы сможете выбирать пол, внешность, класс и предысторию V. Все это также будет иметь свое влияние на события в игре.",
            "game_image": "HW23/images/Обложка_компьютерной_игры_Cyberpunk_2077.jpg",
            "is_active_game": true
        }
    },
    {
        "model": "HW23.games",
        "pk": 5,
        "fields": {
            "name": "Fallout 4",
            "pub_date": "2023-02-05",
            "upd_date": "2023-02-05",
            "release_date": "2015-11-10",
            "price": "15.00",
            "gameDev": 5,
            "slug": "fallout_4",
            "category": 2,
            "description": "Fallout 4 – очередная часть в популярной серии ролевых игр Fallout, действие которой развивается в постапокалиптическом мире, разрушенном ядерной войной. Вы единственный кто выжил из убежища 111, и именно от вас зависит судьба пустошей. Впереди вас ждет постоянная борьба за выживание, а каждое принятое решение может стать последним.\r\n\r\nВ Fallout 4 представлен огромный открытый мир с сотней локаций, заданий и персонажей, продвинутая система крафтинга, которая позволит улучшать и создавать тысячи предметов, система персонажей S.P.E.C.I.A.L, позволяющая создавать любого героя, обновленная система пошагового прицеливания «Волт-Тек» (V.A.T.S), а также графика нового поколения и современный движок.\r\n\r\nВ октябре 2017 года вышла Fallout 4 VR – особая версия игры, разработанная для VR-устройств. В виртуальной реальности вы еще глубже погрузитесь в мир Fallout и ощутите на себе все опасности постапокалиптического мира во время борьбы за свое выживание.",
            "game_image": "HW23/images/Fallout_4_poster.jpg",
            "is_active_game": true
        }
    }
]